app/controllers/notes_controller.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @note = Note.find(params[:id])

INSERT INTO "notes" ("data", "name", "composer", "canview", "arrenged_by", "text_by", "published_by", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @note = Note.new(note_params)

    if @note.save